[
  {
    "title": "Основні тези роботи",
    "description": [
      "Технологія блокчейн — це технологія, на якій засновані платформи для проведення операцій між рівноправними учасниками, які не довіряють одне одному. Оскільки, гарантом виконання умов операції є комп’ютерний алгоритм, то не потрібно зайвих посередників. Завдяки цій технології можливо втілити ідею інтернету нового покоління, що називають «Веб 3.0», основними ідеями якого є децентралізація, захист персональних даних, безпека та відсутність цензури.",
      "Отож, блокчейн — це ланцюжок блоків, який надійно захищений протоколом консенсусу від підробки. Його особливостями є децентралізованість, прозорість та захищеність.",
      "В блокчейні можна зберігати розумні контракти, які є комп’ютерними протоколами, що моделюють реальні контракти. Основними перевагами розумних контрактів є відсутність посередника, економія, надійність та зручність. Останнім часом з'являється багато програмних продуктів, які використовують розумні контракти. Найпопулярнішими платформами для створення розумних контрактів є Ефіріум, Кардано, НЕО та ІОС.",
      "Зараз навколо технології блокчейн сформувалася ціла галузь, яка будує свою роботу, використовуючи віртуальну валюту і відповідні технології. Сьогодні велика кількість компаній  розробляють і випробовують нові напрямки, в рамках яких ця технологія може бути використана.",
      "Розумні контракти являють собою набір правил, які виконуються автоматично, та є встановленими в конкретному порядку щодо особливих індивідуальних вимог кожної угоди відповідно до кількості, якості, ціни і т.п. Таким чином визначені вимоги дозволяють, в автоматичному режимі, підбирати потенційних споживачів для постачальників або співпрацювати на основі розподілених реєстрів.",
      "В роботі пропонується створення інформаційної системи керування ризиками в страховій діяльності, а також відповідного прикладного програмного продукту за допомогою «розумних контрактів» на базі платформи Ефіріум."
    ]
  }
]