[
  {
    "title": "Децентралізовані додатки",
    "description": [
      {
        "text": "DApps (decentralized applications) — децентралізовані сервер-клієнтські додатки, які працюють у децентралізованих системах на зразок Ethereum чи EOS. Особливістю роботи децентралізованих систем є те, що у таких системах кожен вузол системи (комп'ютер) здійснює обчислення, на відміну від централізованих та розподілених систем."
      }
    ]
  },
  {
    "title": "Популярність децентралізованих додатків",
    "description": [
      {
        "text": "Згідно з даними порталу <a href='https://www.stateofthedapps.com' alt='site State of the dapps'>State of the Dapps</a> кількість децентралізованих додатків постійно зростає.",
        "image": "dapps-popularity"
      },
      {
        "text": "Найпопулярнішими серед користувачів є додатки для зберігання даних, обміну крипто валютою, фінансами та азартними іграми. Найбільша кількість транзакцій в ігрових додатках, додатках для обміну крипто валютою та для азартних ігор.",
        "image": "dapps-categories"
      }
    ]
  },
  {
    "title": "Платформи для написання розумних контрактів",
    "description": [
      {
        "text": "Для того щоб створити децентралізований додаток в першу чергу потрібно написати розумні контракти, які будуть автоматично виконуватись в блокчейні."
      },
      {
        "text": "Станом на 2018 рік існує більше ніж 30 платформ для написання розумних контрактів, проте найпопулярнішими з них є платформи <a href='https://www.ethereum.org' alt='ethereum platform'>Ethereum</a>, <a href='https://eos.io/' alt='eos platform'>EOS</a>, <a href='https://www.cardano.org/en/home/' alt='cardano platform'>Cardano</a> та <a href='https://neo.org/' alt='neo-platform'>NEO</a>.",
        "image": "dapps-platforms"
      }
    ]
  },
  {
    "title": "Фреймворки та бібліотеки для розробки клієнтської частини",
    "description": [
      {
        "text": "Окрім написання розумних контрактів, потрібно створити клієнтську частину для децентралізованих додатків."
      },
      {
        "text": "Розробка клієнтської частини додатків є складною задачею. Для спрощення вирішення цієї задачі створили різноманітні інструменти (фреймворки і бібліотеки), щоб спростити та збільшити швидкість процесу розробки."
      },
      {
        "text": "За кількостями оцінок на платформі <a href='https://github.com' alt='github'>github</a> найпопулярнішими є: фреймворк Vue (108078), бібліотека React (106798) та фреймворк Angular (33450).",
        "image": "frameworks-stars-git"
      },
      {
        "text": "За кількістю завантажень пакетним менджером NPM лідирує бібліотека React, яка, як історично склалося, є і найпопулярнішою для розробки клієнтської частини децентралізованих додатків.",
        "image": "frameworks-downloads-npm"
      }
    ]
  }
]