[
  {
    "title": "Прототип додатку",
    "description": [
      {
        "text": "Додаток модулює роботу системи взаємного страхування життя. В такій системі відсутній централізований контроль, і кожен учасник є страховиком і страхувальником одночасно. Код додатку знаходиться у <a href='https://github.com/ykulynych/mutual-insurance' alt='source code'>відкритому доступі</a>"
      }
    ]
  },
  {
    "title": "Підготовка до запуску додатку",
    "description": [
      {
        "text": "Для початку потрібно завантажити і запустити клієнт <a href='https://truffleframework.com/ganache' alt='ganache'>Ganache</a>. А також налаштувати змінити порт в файлі truffle.js за потреби.",
        "image": "ganache-client"
      },
      {
        "text": "Після цього потрібно встановити плагін <a href='https://metamask.io/' alt='metamask'>Metamask</a> для браузера Google Chrome.",
        "image": "meta-mask"
      },
      {
        "text": "В плагіні потрібно натиснути кнопку Import using account and seed phrase. У вікні яке з'явиться необхідно ввести фразу, яка написана над акаунтами в клаєнті Ganache - mnemonic",
        "image": "meta-mask-seed"
      },
      {
        "text": "Після цього потрібно обрати правильну мережу http://127.0.0.1:7545, і можна запускати додаток",
        "image": "meta-mask-network"
      },
      {
        "text": "Після цього потрібно запустити команди, які прописані в репозиторії."
      }
    ]
  },
  {
    "title": "Робота додатку",
    "description": [
      {
        "text": "Для початку користувачу буде доступна тільки функція реєстрації",
        "image": "dapp-register"
      },
      {
        "text": "Коли він успішно зареєструється стане доступною можливість редагувати профайл і створювати поліс",
        "image": "profile"
      },
      {
        "text": "Коли поліс створено, то в ньому будуть доступні функції сплати внесків, повідомлення про страховий випадок та відміни полісу.",
        "image": "profile-policy"
      },
      {
        "text": "Якщо користувач повідомить про страховий випадок, то в його профайлі з'явиться кнопка отримати компенсацію.",
        "image": "profile-withdraw"
      }
    ]
  }
]